Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 10547, 1)]   0                                            
__________________________________________________________________________________________________
zero_padding1d (ZeroPadding1D)  (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 10560, 64)    192         zero_padding1d[0][0]             
__________________________________________________________________________________________________
activation (Activation)         (None, 10560, 64)    0           conv1d[0][0]                     
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 329, 64, 64)  0           activation[0][0]                 
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 329, 4096)    0           lambda[0][0]                     
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 329, 200)     3357600     reshape_2[0][0]                  
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 329, 200)     240800      bidirectional[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 329, 8192)    1646592     bidirectional_1[0][0]            
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 329, 64, 128) 0           dense[0][0]                      
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, 128)    0           reshape_3[0][0]                  
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 10560, 64, 2) 0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 10560, 64)    0           reshape_4[0][0]                  
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 10560, 64)    0           reshape_4[0][0]                  
__________________________________________________________________________________________________
multiply (Multiply)             (None, 10560, 64)    0           activation[0][0]                 
                                                                 lambda_2[0][0]                   
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 10560, 64)    0           activation[0][0]                 
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10560, 2)     130         multiply[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10560, 2)     130         multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, None)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, None)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, None, 1)      0           lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, None, 1)      0           lambda_6[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, 2)      0           lambda_4[0][0]                   
                                                                 lambda_7[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, None, 2)      0           concatenate[0][0]                
==================================================================================================
Total params: 5,245,444
Trainable params: 5,245,444
Non-trainable params: 0
__________________________________________________________________________________________________
