_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 10547, 1)          0         
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10560, 64)         192       
_________________________________________________________________
activation_1 (Activation)    (None, 10560, 64)         0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 329, 64, 64)       0         
_________________________________________________________________
reshape_5 (Reshape)          (None, 329, 4096)         0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 329, 256)          4457472   
_________________________________________________________________
lstm_2 (LSTM)                (None, 329, 256)          525312    
_________________________________________________________________
dense_1 (Dense)              (None, 329, 64)           16448     
_________________________________________________________________
layer_normalization_1 (Layer (None, 329, 64)           0         
_________________________________________________________________
lambda_2 (Lambda)            (None, None)              0         
_________________________________________________________________
lambda_3 (Lambda)            (None, None, 1)           0         
_________________________________________________________________
lambda_4 (Lambda)            (None, None, 1)           0         
=================================================================
Total params: 4,999,424
Trainable params: 4,999,424
Non-trainable params: 0
_________________________________________________________________
