Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
raw_input (InputLayer)       [(None, 10547, 1)]        0         
_________________________________________________________________
zero_padding1d (ZeroPadding1 (None, 12288, 1)          0         
_________________________________________________________________
Down_Conv_0 (Conv1D)         (None, 12288, 24)         384       
_________________________________________________________________
Down_Conv_Activ_0 (LeakyReLU (None, 12288, 24)         0         
_________________________________________________________________
Down_BN_0 (BatchNormalizatio (None, 12288, 24)         96        
_________________________________________________________________
Decimate_0 (Lambda)          (None, 6144, 24)          0         
_________________________________________________________________
Down_Conv_1 (Conv1D)         (None, 6144, 48)          17328     
_________________________________________________________________
Down_Conv_Activ_1 (LeakyReLU (None, 6144, 48)          0         
_________________________________________________________________
Down_BN_1 (BatchNormalizatio (None, 6144, 48)          192       
_________________________________________________________________
Decimate_1 (Lambda)          (None, 3072, 48)          0         
_________________________________________________________________
Down_Conv_2 (Conv1D)         (None, 3072, 72)          51912     
_________________________________________________________________
Down_Conv_Activ_2 (LeakyReLU (None, 3072, 72)          0         
_________________________________________________________________
Down_BN_2 (BatchNormalizatio (None, 3072, 72)          288       
_________________________________________________________________
Decimate_2 (Lambda)          (None, 1536, 72)          0         
_________________________________________________________________
Down_Conv_3 (Conv1D)         (None, 1536, 96)          103776    
_________________________________________________________________
Down_Conv_Activ_3 (LeakyReLU (None, 1536, 96)          0         
_________________________________________________________________
Down_BN_3 (BatchNormalizatio (None, 1536, 96)          384       
_________________________________________________________________
Decimate_3 (Lambda)          (None, 768, 96)           0         
_________________________________________________________________
Down_Conv_4 (Conv1D)         (None, 768, 120)          172920    
_________________________________________________________________
Down_Conv_Activ_4 (LeakyReLU (None, 768, 120)          0         
_________________________________________________________________
Down_BN_4 (BatchNormalizatio (None, 768, 120)          480       
_________________________________________________________________
Decimate_4 (Lambda)          (None, 384, 120)          0         
_________________________________________________________________
Down_Conv_5 (Conv1D)         (None, 384, 144)          259344    
_________________________________________________________________
Down_Conv_Activ_5 (LeakyReLU (None, 384, 144)          0         
_________________________________________________________________
Down_BN_5 (BatchNormalizatio (None, 384, 144)          576       
_________________________________________________________________
exp_dims_0_0 (Lambda)        (None, 1, 384, 144)       0         
_________________________________________________________________
IntPol_0_0 (InterpolationLay (None, 1, 768, 144)       144       
_________________________________________________________________
sq_dims_0_0 (Lambda)         (None, 768, 144)          0         
_________________________________________________________________
Up_Conv_0_0 (Conv1D)         (None, 768, 120)          86520     
_________________________________________________________________
Up_Conv_Activ_0_0 (LeakyReLU (None, 768, 120)          0         
_________________________________________________________________
Up_BN_0_0 (BatchNormalizatio (None, 768, 120)          480       
_________________________________________________________________
exp_dims_0_1 (Lambda)        (None, 1, 768, 120)       0         
_________________________________________________________________
IntPol_0_1 (InterpolationLay (None, 1, 1536, 120)      120       
_________________________________________________________________
sq_dims_0_1 (Lambda)         (None, 1536, 120)         0         
_________________________________________________________________
Up_Conv_0_1 (Conv1D)         (None, 1536, 96)          57696     
_________________________________________________________________
Up_Conv_Activ_0_1 (LeakyReLU (None, 1536, 96)          0         
_________________________________________________________________
Up_BN_0_1 (BatchNormalizatio (None, 1536, 96)          384       
_________________________________________________________________
exp_dims_0_2 (Lambda)        (None, 1, 1536, 96)       0         
_________________________________________________________________
IntPol_0_2 (InterpolationLay (None, 1, 3072, 96)       96        
_________________________________________________________________
sq_dims_0_2 (Lambda)         (None, 3072, 96)          0         
_________________________________________________________________
Up_Conv_0_2 (Conv1D)         (None, 3072, 72)          34632     
_________________________________________________________________
Up_Conv_Activ_0_2 (LeakyReLU (None, 3072, 72)          0         
_________________________________________________________________
Up_BN_0_2 (BatchNormalizatio (None, 3072, 72)          288       
_________________________________________________________________
exp_dims_0_3 (Lambda)        (None, 1, 3072, 72)       0         
_________________________________________________________________
IntPol_0_3 (InterpolationLay (None, 1, 6144, 72)       72        
_________________________________________________________________
sq_dims_0_3 (Lambda)         (None, 6144, 72)          0         
_________________________________________________________________
Up_Conv_0_3 (Conv1D)         (None, 6144, 48)          17328     
_________________________________________________________________
Up_Conv_Activ_0_3 (LeakyReLU (None, 6144, 48)          0         
_________________________________________________________________
Up_BN_0_3 (BatchNormalizatio (None, 6144, 48)          192       
_________________________________________________________________
exp_dims_0_4 (Lambda)        (None, 1, 6144, 48)       0         
_________________________________________________________________
IntPol_0_4 (InterpolationLay (None, 1, 12288, 48)      48        
_________________________________________________________________
sq_dims_0_4 (Lambda)         (None, 12288, 48)         0         
_________________________________________________________________
Up_Conv_0_4 (Conv1D)         (None, 12288, 24)         5784      
_________________________________________________________________
Up_Conv_Activ_0_4 (LeakyReLU (None, 12288, 24)         0         
_________________________________________________________________
Up_BN_0_4 (BatchNormalizatio (None, 12288, 24)         96        
_________________________________________________________________
independent_out_0 (Conv1D)   (None, 12288, 1)          25        
_________________________________________________________________
Out_clip (Lambda)            (None, 10547, 1)          0         
=================================================================
Total params: 811,585
Trainable params: 809,857
Non-trainable params: 1,728
_________________________________________________________________
