__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10547, 1)     0                                            
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10560, 16)    64          zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 10560, 16)    64          conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 10560, 16)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 5280, 16)     0           activation_1[0][0]               
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 5280, 16)     784         max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 5280, 16)     64          conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 5280, 16)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 2640, 16)     0           activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 2640, 32)     1568        max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 2640, 32)     128         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 2640, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 1320, 32)     0           activation_3[0][0]               
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 1320, 32)     3104        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1320, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 1320, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 660, 32)      0           activation_4[0][0]               
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 660, 64)      6208        max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 660, 64)      256         conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 660, 64)      0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 330, 64)      0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 330, 64)      12352       max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 330, 64)      256         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 330, 64)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 165, 64)      0           activation_6[0][0]               
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 165, 128)     24704       max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 165, 128)     512         conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 165, 128)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 83, 128)      0           activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 83, 128)      49280       max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 83, 128)      512         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 83, 128)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 42, 128)      0           activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 42, 256)      98560       max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 42, 256)      1024        conv1d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 42, 256)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 21, 256)      0           activation_9[0][0]               
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 21, 256)      196864      max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 21, 256)      1024        conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 21, 256)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 11, 256)      0           activation_10[0][0]              
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 11, 256)      196864      max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 11, 256)      1024        conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 11, 256)      0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, 6, 256)       0           activation_11[0][0]              
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 6, 256)       196864      max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 6, 256)       1024        conv1d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 6, 256)       0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, 3, 256)       0           activation_12[0][0]              
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 1, 256)       196864      max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1, 256)       1024        conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 256)       0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 256)          0           activation_13[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            257         reshape_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            257         reshape_1[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           dense_1[0][0]                    
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 256)          512         lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1, 256)       0           dense_3[0][0]                    
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1, 1, 256)    0           lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 3, 1, 256)    65792       lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 3, 256)       0           conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 3, 256)       1024        lambda_4[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 3, 1, 256)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 6, 1, 256)    131328      lambda_5[0][0]                   
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 6, 256)       0           conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 6, 256)       1024        lambda_6[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 6, 1, 256)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 12, 1, 256)   131328      lambda_7[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 12, 256)      0           conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 12, 256)      1024        lambda_8[0][0]                   
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 11, 256)      131328      batch_normalization_16[0][0]     
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 11, 1, 256)   0           conv1d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 22, 1, 256)   131328      lambda_9[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 22, 256)      0           conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 22, 256)      1024        lambda_10[0][0]                  
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 21, 256)      131328      batch_normalization_17[0][0]     
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 21, 1, 256)   0           conv1d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 42, 1, 256)   131328      lambda_11[0][0]                  
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 42, 256)      0           conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 42, 256)      1024        lambda_12[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 42, 1, 256)   0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 84, 1, 128)   65664       lambda_13[0][0]                  
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 84, 128)      0           conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 84, 128)      512         lambda_14[0][0]                  
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 83, 128)      32896       batch_normalization_19[0][0]     
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 83, 1, 128)   0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 166, 1, 128)  32896       lambda_15[0][0]                  
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 166, 128)     0           conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 166, 128)     512         lambda_16[0][0]                  
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 165, 128)     32896       batch_normalization_20[0][0]     
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 165, 1, 128)  0           conv1d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 330, 1, 64)   16448       lambda_17[0][0]                  
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 330, 64)      0           conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 330, 64)      256         lambda_18[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 330, 1, 64)   0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 660, 1, 64)   8256        lambda_19[0][0]                  
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 660, 64)      0           conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 660, 64)      256         lambda_20[0][0]                  
__________________________________________________________________________________________________
lambda_21 (Lambda)              (None, 660, 1, 64)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 1320, 1, 32)  4128        lambda_21[0][0]                  
__________________________________________________________________________________________________
lambda_22 (Lambda)              (None, 1320, 32)     0           conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 1320, 32)     128         lambda_22[0][0]                  
__________________________________________________________________________________________________
lambda_23 (Lambda)              (None, 1320, 1, 32)  0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 2640, 1, 32)  2080        lambda_23[0][0]                  
__________________________________________________________________________________________________
lambda_24 (Lambda)              (None, 2640, 32)     0           conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 2640, 32)     128         lambda_24[0][0]                  
__________________________________________________________________________________________________
lambda_25 (Lambda)              (None, 2640, 1, 32)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 5280, 1, 16)  1040        lambda_25[0][0]                  
__________________________________________________________________________________________________
lambda_26 (Lambda)              (None, 5280, 16)     0           conv2d_transpose_12[0][0]        
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 5280, 16)     64          lambda_26[0][0]                  
__________________________________________________________________________________________________
lambda_27 (Lambda)              (None, 5280, 1, 16)  0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 10560, 1, 16) 528         lambda_27[0][0]                  
__________________________________________________________________________________________________
lambda_28 (Lambda)              (None, 10560, 16)    0           conv2d_transpose_13[0][0]        
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 10560, 16)    64          lambda_28[0][0]                  
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 10560, 1)     17          batch_normalization_26[0][0]     
__________________________________________________________________________________________________
lambda_29 (Lambda)              (None, 10547, 1)     0           conv1d_18[0][0]                  
==================================================================================================
Total params: 2,049,795
Trainable params: 2,042,755
Non-trainable params: 7,040
__________________________________________________________________________________________________
