__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10547)        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          1350144     input_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 256)          33024       dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            257         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            257         dense_2[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           dense_3[0][0]                    
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          512         lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1, 256)       0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1, 128)       32896       lambda_2[0][0]                   
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1, 10547)     1360563     dense_6[0][0]                    
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1, 10547)     0           dense_7[0][0]                    
==================================================================================================
Total params: 2,777,653
Trainable params: 2,777,653
Non-trainable params: 0
__________________________________________________________________________________________________
