__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 4, 1)         0                                            
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 1, 1)         0           lambda_17[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 1, 1)         0           lambda_18[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 1, 1)         0           lambda_19[0][0]                  
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 1, 1)         0           lambda_20[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1, 65800)     65800       reshape_5[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1, 65800)     65800       reshape_7[0][0]                  
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1, 65800)     65800       reshape_9[0][0]                  
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1, 65800)     65800       reshape_11[0][0]                 
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 329, 200)     0           dense_9[0][0]                    
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 329, 200)     0           dense_10[0][0]                   
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 329, 200)     0           dense_11[0][0]                   
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 329, 200)     0           dense_12[0][0]                   
__________________________________________________________________________________________________
model_1 (Model)                 (None, None, 1)      1064226     reshape_6[0][0]                  
__________________________________________________________________________________________________
model_2 (Model)                 (None, None, 1)      1064226     reshape_8[0][0]                  
__________________________________________________________________________________________________
model_3 (Model)                 (None, None, 1)      1064226     reshape_10[0][0]                 
__________________________________________________________________________________________________
model_4 (Model)                 (None, None, 1)      1064226     reshape_12[0][0]                 
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 1)      0           model_1[1][0]                    
                                                                 model_2[1][0]                    
                                                                 model_3[1][0]                    
                                                                 model_4[1][0]                    
==================================================================================================
Total params: 4,520,104
Trainable params: 263,200
Non-trainable params: 4,256,904
__________________________________________________________________________________________________
