Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 4, 1)]       0                                            
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 1)         0           lambda_4[0][0]                   
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 1)         0           lambda_5[0][0]                   
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 1, 1)         0           lambda_6[0][0]                   
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 1, 1)         0           lambda_7[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 1, 79200)     79200       reshape[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1, 79200)     79200       reshape_2[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1, 79200)     79200       reshape_4[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1, 79200)     79200       reshape_6[0][0]                  
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 660, 120)     0           dense[0][0]                      
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 660, 120)     0           dense_1[0][0]                    
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 660, 120)     0           dense_2[0][0]                    
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 660, 120)     0           dense_3[0][0]                    
__________________________________________________________________________________________________
model (Functional)              (None, 10547, 1)     115801      reshape_1[0][0]                  
__________________________________________________________________________________________________
model_1 (Functional)            (None, 10547, 1)     115801      reshape_3[0][0]                  
__________________________________________________________________________________________________
model_2 (Functional)            (None, 10547, 1)     115801      reshape_5[0][0]                  
__________________________________________________________________________________________________
model_3 (Functional)            (None, 10547, 1)     115801      reshape_7[0][0]                  
__________________________________________________________________________________________________
add (Add)                       (None, 10547, 1)     0           model[0][0]                      
                                                                 model_1[0][0]                    
                                                                 model_2[0][0]                    
                                                                 model_3[0][0]                    
==================================================================================================
Total params: 780,004
Trainable params: 316,800
Non-trainable params: 463,204
__________________________________________________________________________________________________
