Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 10547, 1)]   0                                            
__________________________________________________________________________________________________
zero_padding1d (ZeroPadding1D)  (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 10560, 64)    192         zero_padding1d[0][0]             
__________________________________________________________________________________________________
activation (Activation)         (None, 10560, 64)    0           conv1d[0][0]                     
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 329, 64, 64)  0           activation[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (2632, 64, 64)       0           lambda[0][0]                     
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (2632, 64, 200)      132000      lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (168448, 200)        0           bidirectional[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (168448, 64)         12864       lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (8, 1347584)         0           dense[0][0]                      
__________________________________________________________________________________________________
layer_normalization (LayerNorma (8, 1347584)         0           lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (8, 329, 64, 64)     0           layer_normalization[0][0]        
__________________________________________________________________________________________________
add (Add)                       (8, 329, 64, 64)     0           lambda[0][0]                     
                                                                 lambda_4[0][0]                   
__________________________________________________________________________________________________
permute (Permute)               (8, 64, 329, 64)     0           add[0][0]                        
__________________________________________________________________________________________________
lambda_5 (Lambda)               (512, 329, 64)       0           permute[0][0]                    
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (512, 329, 200)      132000      lambda_5[0][0]                   
__________________________________________________________________________________________________
lambda_6 (Lambda)               (168448, 200)        0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (168448, 64)         12864       lambda_6[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (8, 1347584)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (8, 1347584)         0           lambda_7[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (8, 64, 329, 64)     0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (8, 64, 329, 64)     0           permute[0][0]                    
                                                                 lambda_8[0][0]                   
__________________________________________________________________________________________________
permute_1 (Permute)             (8, 329, 64, 64)     0           add_1[0][0]                      
__________________________________________________________________________________________________
lambda_9 (Lambda)               (2632, 64, 64)       0           permute_1[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (2632, 64, 200)      132000      lambda_9[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (168448, 200)        0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (168448, 64)         12864       lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_11 (Lambda)              (8, 1347584)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (8, 1347584)         0           lambda_11[0][0]                  
__________________________________________________________________________________________________
lambda_12 (Lambda)              (8, 329, 64, 64)     0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (8, 329, 64, 64)     0           permute_1[0][0]                  
                                                                 lambda_12[0][0]                  
__________________________________________________________________________________________________
permute_2 (Permute)             (8, 64, 329, 64)     0           add_2[0][0]                      
__________________________________________________________________________________________________
lambda_13 (Lambda)              (512, 329, 64)       0           permute_2[0][0]                  
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (512, 329, 200)      132000      lambda_13[0][0]                  
__________________________________________________________________________________________________
lambda_14 (Lambda)              (168448, 200)        0           bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (168448, 256)        51456       lambda_14[0][0]                  
__________________________________________________________________________________________________
lambda_15 (Lambda)              (8, 5390336)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (8, 5390336)         0           lambda_15[0][0]                  
__________________________________________________________________________________________________
lambda_16 (Lambda)              (8, 64, 329, 256)    0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
permute_3 (Permute)             (8, 329, 64, 256)    0           lambda_16[0][0]                  
__________________________________________________________________________________________________
lambda_17 (Lambda)              (8, 10560, 256)      0           permute_3[0][0]                  
__________________________________________________________________________________________________
reshape_2 (Reshape)             (8, 10560, 64, 4)    0           lambda_17[0][0]                  
__________________________________________________________________________________________________
lambda_18 (Lambda)              (8, 10560, 64)       0           reshape_2[0][0]                  
__________________________________________________________________________________________________
lambda_21 (Lambda)              (8, 10560, 64)       0           reshape_2[0][0]                  
__________________________________________________________________________________________________
lambda_24 (Lambda)              (8, 10560, 64)       0           reshape_2[0][0]                  
__________________________________________________________________________________________________
lambda_27 (Lambda)              (8, 10560, 64)       0           reshape_2[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (8, 10560, 2)        130         lambda_18[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (8, 10560, 2)        130         lambda_21[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (8, 10560, 2)        130         lambda_24[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (8, 10560, 2)        130         lambda_27[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              (8, 10561)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
lambda_22 (Lambda)              (8, 10561)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
lambda_25 (Lambda)              (8, 10561)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
lambda_28 (Lambda)              (8, 10561)           0           dense_7[0][0]                    
__________________________________________________________________________________________________
lambda_20 (Lambda)              (8, 10561, 1)        0           lambda_19[0][0]                  
__________________________________________________________________________________________________
lambda_23 (Lambda)              (8, 10561, 1)        0           lambda_22[0][0]                  
__________________________________________________________________________________________________
lambda_26 (Lambda)              (8, 10561, 1)        0           lambda_25[0][0]                  
__________________________________________________________________________________________________
lambda_29 (Lambda)              (8, 10561, 1)        0           lambda_28[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (8, 10561, 4)        0           lambda_20[0][0]                  
                                                                 lambda_23[0][0]                  
                                                                 lambda_26[0][0]                  
                                                                 lambda_29[0][0]                  
__________________________________________________________________________________________________
lambda_30 (Lambda)              (8, 10547, 4)        0           concatenate[0][0]                
==================================================================================================
Total params: 618,760
Trainable params: 618,760
Non-trainable params: 0
__________________________________________________________________________________________________
