Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 10547, 1)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 10547, 64)    192         input_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, 10547, 64)    128         conv1d[0][0]                     
__________________________________________________________________________________________________
bottleneck_layer (Conv1D)       (None, 10547, 64)    4160        layer_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10547, 128)   8320        bottleneck_layer[0][0]           
__________________________________________________________________________________________________
p_re_lu (PReLU)                 (None, 10547, 128)   128         conv1d_1[0][0]                   
__________________________________________________________________________________________________
global_normalization (GlobalNor (None, 10547, 128)   256         p_re_lu[0][0]                    
__________________________________________________________________________________________________
zero_padding1d (ZeroPadding1D)  (None, 10549, 128)   0           global_normalization[0][0]       
__________________________________________________________________________________________________
depthwise_conv1d (DepthwiseConv (None, 10547, 128)   512         zero_padding1d[0][0]             
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 10547, 128)   128         depthwise_conv1d[0][0]           
__________________________________________________________________________________________________
global_normalization_1 (GlobalN (None, 10547, 128)   256         p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 10547, 64)    8256        global_normalization_1[0][0]     
__________________________________________________________________________________________________
add (Add)                       (None, 10547, 64)    0           bottleneck_layer[0][0]           
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 10547, 128)   8320        add[0][0]                        
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 10547, 128)   128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
global_normalization_2 (GlobalN (None, 10547, 128)   256         p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10551, 128)   0           global_normalization_2[0][0]     
__________________________________________________________________________________________________
depthwise_conv1d_1 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, 10547, 128)   128         depthwise_conv1d_1[0][0]         
__________________________________________________________________________________________________
global_normalization_3 (GlobalN (None, 10547, 128)   256         p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 10547, 64)    8256        global_normalization_3[0][0]     
__________________________________________________________________________________________________
add_1 (Add)                     (None, 10547, 64)    0           add[0][0]                        
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 10547, 128)   8320        add_1[0][0]                      
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 10547, 128)   128         conv1d_7[0][0]                   
__________________________________________________________________________________________________
global_normalization_4 (GlobalN (None, 10547, 128)   256         p_re_lu_4[0][0]                  
__________________________________________________________________________________________________
zero_padding1d_2 (ZeroPadding1D (None, 10555, 128)   0           global_normalization_4[0][0]     
__________________________________________________________________________________________________
depthwise_conv1d_2 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_2[0][0]           
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 10547, 128)   128         depthwise_conv1d_2[0][0]         
__________________________________________________________________________________________________
global_normalization_5 (GlobalN (None, 10547, 128)   256         p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 10547, 64)    8256        global_normalization_5[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, 10547, 64)    0           add_1[0][0]                      
                                                                 conv1d_8[0][0]                   
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 10547, 128)   8320        add_2[0][0]                      
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, 10547, 128)   128         conv1d_10[0][0]                  
__________________________________________________________________________________________________
global_normalization_6 (GlobalN (None, 10547, 128)   256         p_re_lu_6[0][0]                  
__________________________________________________________________________________________________
zero_padding1d_3 (ZeroPadding1D (None, 10563, 128)   0           global_normalization_6[0][0]     
__________________________________________________________________________________________________
depthwise_conv1d_3 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_3[0][0]           
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 10547, 128)   128         depthwise_conv1d_3[0][0]         
__________________________________________________________________________________________________
global_normalization_7 (GlobalN (None, 10547, 128)   256         p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 10547, 64)    8256        global_normalization_7[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, 10547, 64)    0           add_2[0][0]                      
                                                                 conv1d_11[0][0]                  
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 10547, 128)   8320        add_3[0][0]                      
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 10547, 128)   128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
global_normalization_8 (GlobalN (None, 10547, 128)   256         p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
zero_padding1d_4 (ZeroPadding1D (None, 10579, 128)   0           global_normalization_8[0][0]     
__________________________________________________________________________________________________
depthwise_conv1d_4 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_4[0][0]           
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, 10547, 128)   128         depthwise_conv1d_4[0][0]         
__________________________________________________________________________________________________
global_normalization_9 (GlobalN (None, 10547, 128)   256         p_re_lu_9[0][0]                  
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 10547, 64)    8256        global_normalization_1[0][0]     
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 10547, 64)    8256        global_normalization_3[0][0]     
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 10547, 64)    8256        global_normalization_5[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 10547, 64)    8256        global_normalization_7[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 10547, 64)    8256        global_normalization_9[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 10547, 64)    0           conv1d_3[0][0]                   
                                                                 conv1d_6[0][0]                   
                                                                 conv1d_9[0][0]                   
                                                                 conv1d_12[0][0]                  
                                                                 conv1d_15[0][0]                  
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 10547, 128)   8320        add_5[0][0]                      
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, 10547, 128)   128         conv1d_16[0][0]                  
__________________________________________________________________________________________________
global_normalization_10 (Global (None, 10547, 128)   256         p_re_lu_10[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_5 (ZeroPadding1D (None, 10549, 128)   0           global_normalization_10[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_5 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_5[0][0]           
__________________________________________________________________________________________________
p_re_lu_11 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_5[0][0]         
__________________________________________________________________________________________________
global_normalization_11 (Global (None, 10547, 128)   256         p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 10547, 64)    8256        global_normalization_11[0][0]    
__________________________________________________________________________________________________
add_6 (Add)                     (None, 10547, 64)    0           add_5[0][0]                      
                                                                 conv1d_17[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 10547, 128)   8320        add_6[0][0]                      
__________________________________________________________________________________________________
p_re_lu_12 (PReLU)              (None, 10547, 128)   128         conv1d_19[0][0]                  
__________________________________________________________________________________________________
global_normalization_12 (Global (None, 10547, 128)   256         p_re_lu_12[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_6 (ZeroPadding1D (None, 10551, 128)   0           global_normalization_12[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_6 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_6[0][0]           
__________________________________________________________________________________________________
p_re_lu_13 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_6[0][0]         
__________________________________________________________________________________________________
global_normalization_13 (Global (None, 10547, 128)   256         p_re_lu_13[0][0]                 
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 10547, 64)    8256        global_normalization_13[0][0]    
__________________________________________________________________________________________________
add_7 (Add)                     (None, 10547, 64)    0           add_6[0][0]                      
                                                                 conv1d_20[0][0]                  
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 10547, 128)   8320        add_7[0][0]                      
__________________________________________________________________________________________________
p_re_lu_14 (PReLU)              (None, 10547, 128)   128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
global_normalization_14 (Global (None, 10547, 128)   256         p_re_lu_14[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_7 (ZeroPadding1D (None, 10555, 128)   0           global_normalization_14[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_7 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_7[0][0]           
__________________________________________________________________________________________________
p_re_lu_15 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_7[0][0]         
__________________________________________________________________________________________________
global_normalization_15 (Global (None, 10547, 128)   256         p_re_lu_15[0][0]                 
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 10547, 64)    8256        global_normalization_15[0][0]    
__________________________________________________________________________________________________
add_8 (Add)                     (None, 10547, 64)    0           add_7[0][0]                      
                                                                 conv1d_23[0][0]                  
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 10547, 128)   8320        add_8[0][0]                      
__________________________________________________________________________________________________
p_re_lu_16 (PReLU)              (None, 10547, 128)   128         conv1d_25[0][0]                  
__________________________________________________________________________________________________
global_normalization_16 (Global (None, 10547, 128)   256         p_re_lu_16[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_8 (ZeroPadding1D (None, 10563, 128)   0           global_normalization_16[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_8 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_8[0][0]           
__________________________________________________________________________________________________
p_re_lu_17 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_8[0][0]         
__________________________________________________________________________________________________
global_normalization_17 (Global (None, 10547, 128)   256         p_re_lu_17[0][0]                 
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 10547, 64)    8256        global_normalization_17[0][0]    
__________________________________________________________________________________________________
add_9 (Add)                     (None, 10547, 64)    0           add_8[0][0]                      
                                                                 conv1d_26[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 10547, 128)   8320        add_9[0][0]                      
__________________________________________________________________________________________________
p_re_lu_18 (PReLU)              (None, 10547, 128)   128         conv1d_28[0][0]                  
__________________________________________________________________________________________________
global_normalization_18 (Global (None, 10547, 128)   256         p_re_lu_18[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_9 (ZeroPadding1D (None, 10579, 128)   0           global_normalization_18[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_9 (DepthwiseCo (None, 10547, 128)   512         zero_padding1d_9[0][0]           
__________________________________________________________________________________________________
p_re_lu_19 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_9[0][0]         
__________________________________________________________________________________________________
global_normalization_19 (Global (None, 10547, 128)   256         p_re_lu_19[0][0]                 
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 10547, 64)    8256        global_normalization_19[0][0]    
__________________________________________________________________________________________________
add_10 (Add)                    (None, 10547, 64)    0           add_9[0][0]                      
                                                                 conv1d_29[0][0]                  
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 10547, 128)   8320        add_10[0][0]                     
__________________________________________________________________________________________________
p_re_lu_20 (PReLU)              (None, 10547, 128)   128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
global_normalization_20 (Global (None, 10547, 128)   256         p_re_lu_20[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_10 (ZeroPadding1 (None, 10549, 128)   0           global_normalization_20[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_10 (DepthwiseC (None, 10547, 128)   512         zero_padding1d_10[0][0]          
__________________________________________________________________________________________________
p_re_lu_21 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_10[0][0]        
__________________________________________________________________________________________________
global_normalization_21 (Global (None, 10547, 128)   256         p_re_lu_21[0][0]                 
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, 10547, 64)    8256        global_normalization_21[0][0]    
__________________________________________________________________________________________________
add_12 (Add)                    (None, 10547, 64)    0           add_10[0][0]                     
                                                                 conv1d_32[0][0]                  
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, 10547, 128)   8320        add_12[0][0]                     
__________________________________________________________________________________________________
p_re_lu_22 (PReLU)              (None, 10547, 128)   128         conv1d_34[0][0]                  
__________________________________________________________________________________________________
global_normalization_22 (Global (None, 10547, 128)   256         p_re_lu_22[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_11 (ZeroPadding1 (None, 10551, 128)   0           global_normalization_22[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_11 (DepthwiseC (None, 10547, 128)   512         zero_padding1d_11[0][0]          
__________________________________________________________________________________________________
p_re_lu_23 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_11[0][0]        
__________________________________________________________________________________________________
global_normalization_23 (Global (None, 10547, 128)   256         p_re_lu_23[0][0]                 
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, 10547, 64)    8256        global_normalization_23[0][0]    
__________________________________________________________________________________________________
add_13 (Add)                    (None, 10547, 64)    0           add_12[0][0]                     
                                                                 conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, 10547, 128)   8320        add_13[0][0]                     
__________________________________________________________________________________________________
p_re_lu_24 (PReLU)              (None, 10547, 128)   128         conv1d_37[0][0]                  
__________________________________________________________________________________________________
global_normalization_24 (Global (None, 10547, 128)   256         p_re_lu_24[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_12 (ZeroPadding1 (None, 10555, 128)   0           global_normalization_24[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_12 (DepthwiseC (None, 10547, 128)   512         zero_padding1d_12[0][0]          
__________________________________________________________________________________________________
p_re_lu_25 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_12[0][0]        
__________________________________________________________________________________________________
global_normalization_25 (Global (None, 10547, 128)   256         p_re_lu_25[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, 10547, 64)    8256        global_normalization_25[0][0]    
__________________________________________________________________________________________________
add_14 (Add)                    (None, 10547, 64)    0           add_13[0][0]                     
                                                                 conv1d_38[0][0]                  
__________________________________________________________________________________________________
conv1d_40 (Conv1D)              (None, 10547, 128)   8320        add_14[0][0]                     
__________________________________________________________________________________________________
p_re_lu_26 (PReLU)              (None, 10547, 128)   128         conv1d_40[0][0]                  
__________________________________________________________________________________________________
global_normalization_26 (Global (None, 10547, 128)   256         p_re_lu_26[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_13 (ZeroPadding1 (None, 10563, 128)   0           global_normalization_26[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_13 (DepthwiseC (None, 10547, 128)   512         zero_padding1d_13[0][0]          
__________________________________________________________________________________________________
p_re_lu_27 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_13[0][0]        
__________________________________________________________________________________________________
global_normalization_27 (Global (None, 10547, 128)   256         p_re_lu_27[0][0]                 
__________________________________________________________________________________________________
conv1d_41 (Conv1D)              (None, 10547, 64)    8256        global_normalization_27[0][0]    
__________________________________________________________________________________________________
add_15 (Add)                    (None, 10547, 64)    0           add_14[0][0]                     
                                                                 conv1d_41[0][0]                  
__________________________________________________________________________________________________
conv1d_43 (Conv1D)              (None, 10547, 128)   8320        add_15[0][0]                     
__________________________________________________________________________________________________
p_re_lu_28 (PReLU)              (None, 10547, 128)   128         conv1d_43[0][0]                  
__________________________________________________________________________________________________
global_normalization_28 (Global (None, 10547, 128)   256         p_re_lu_28[0][0]                 
__________________________________________________________________________________________________
zero_padding1d_14 (ZeroPadding1 (None, 10579, 128)   0           global_normalization_28[0][0]    
__________________________________________________________________________________________________
depthwise_conv1d_14 (DepthwiseC (None, 10547, 128)   512         zero_padding1d_14[0][0]          
__________________________________________________________________________________________________
p_re_lu_29 (PReLU)              (None, 10547, 128)   128         depthwise_conv1d_14[0][0]        
__________________________________________________________________________________________________
global_normalization_29 (Global (None, 10547, 128)   256         p_re_lu_29[0][0]                 
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 10547, 64)    8256        global_normalization_11[0][0]    
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 10547, 64)    8256        global_normalization_13[0][0]    
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 10547, 64)    8256        global_normalization_15[0][0]    
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 10547, 64)    8256        global_normalization_17[0][0]    
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 10547, 64)    8256        global_normalization_19[0][0]    
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, 10547, 64)    8256        global_normalization_21[0][0]    
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, 10547, 64)    8256        global_normalization_23[0][0]    
__________________________________________________________________________________________________
conv1d_39 (Conv1D)              (None, 10547, 64)    8256        global_normalization_25[0][0]    
__________________________________________________________________________________________________
conv1d_42 (Conv1D)              (None, 10547, 64)    8256        global_normalization_27[0][0]    
__________________________________________________________________________________________________
conv1d_45 (Conv1D)              (None, 10547, 64)    8256        global_normalization_29[0][0]    
__________________________________________________________________________________________________
add_11 (Add)                    (None, 10547, 64)    0           conv1d_18[0][0]                  
                                                                 conv1d_21[0][0]                  
                                                                 conv1d_24[0][0]                  
                                                                 conv1d_27[0][0]                  
                                                                 conv1d_30[0][0]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 10547, 64)    0           conv1d_33[0][0]                  
                                                                 conv1d_36[0][0]                  
                                                                 conv1d_39[0][0]                  
                                                                 conv1d_42[0][0]                  
                                                                 conv1d_45[0][0]                  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 10547, 64)    0           add_11[0][0]                     
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
p_re_lu_30 (PReLU)              (None, 10547, 64)    64          add_18[0][0]                     
__________________________________________________________________________________________________
conv1d_46 (Conv1D)              (None, 10547, 256)   16640       p_re_lu_30[0][0]                 
__________________________________________________________________________________________________
reshape (Reshape)               (None, 10547, 4, 64) 0           conv1d_46[0][0]                  
__________________________________________________________________________________________________
global_normalization_30 (Global (None, 10547, 4, 64) 128         reshape[0][0]                    
__________________________________________________________________________________________________
permute (Permute)               (None, 10547, 64, 4) 0           global_normalization_30[0][0]    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 10547, 64)    0           permute[0][0]                    
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 10547, 64)    0           permute[0][0]                    
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 10547, 64)    0           permute[0][0]                    
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 10547, 64)    0           permute[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 10547, 1, 64) 0           lambda[0][0]                     
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 10547, 1, 64) 0           lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 10547, 1, 64) 0           lambda_6[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 10547, 1, 64) 0           lambda_9[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 10547, 1, 1)  129         lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 10547, 1, 1)  129         lambda_4[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 10547, 1, 1)  129         lambda_7[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 10547, 1, 1)  129         lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 10547, 1)     0           conv2d_transpose[0][0]           
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 10547, 1)     0           conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 10547, 1)     0           conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 10547, 1)     0           conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10547, 4)     0           lambda_2[0][0]                   
                                                                 lambda_5[0][0]                   
                                                                 lambda_8[0][0]                   
                                                                 lambda_11[0][0]                  
==================================================================================================
Total params: 396,996
Trainable params: 396,996
Non-trainable params: 0
__________________________________________________________________________________________________
