__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10547, 1)     0                                            
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10560, 64)    192         zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 10560, 64)    0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 329, 64, 64)  0           activation_1[0][0]               
__________________________________________________________________________________________________
lambda_2 (Lambda)               (2632, 64, 64)       0           lambda_1[0][0]                   
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (2632, 64, 200)      132000      lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (168448, 200)        0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (168448, 64)         12864       lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (8, 1347584)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (8, 1347584)         0           lambda_4[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (8, 329, 64, 64)     0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (8, 329, 64, 64)     0           lambda_1[0][0]                   
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
permute_1 (Permute)             (8, 64, 329, 64)     0           add_1[0][0]                      
__________________________________________________________________________________________________
lambda_6 (Lambda)               (512, 329, 64)       0           permute_1[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (512, 329, 200)      132000      lambda_6[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (168448, 200)        0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (168448, 64)         12864       lambda_7[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (8, 1347584)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (8, 1347584)         0           lambda_8[0][0]                   
__________________________________________________________________________________________________
lambda_9 (Lambda)               (8, 64, 329, 64)     0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (8, 64, 329, 64)     0           permute_1[0][0]                  
                                                                 lambda_9[0][0]                   
__________________________________________________________________________________________________
permute_2 (Permute)             (8, 329, 64, 64)     0           add_2[0][0]                      
__________________________________________________________________________________________________
lambda_10 (Lambda)              (2632, 64, 64)       0           permute_2[0][0]                  
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (2632, 64, 200)      132000      lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_11 (Lambda)              (168448, 200)        0           bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (168448, 64)         12864       lambda_11[0][0]                  
__________________________________________________________________________________________________
lambda_12 (Lambda)              (8, 1347584)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (8, 1347584)         0           lambda_12[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              (8, 329, 64, 64)     0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (8, 329, 64, 64)     0           permute_2[0][0]                  
                                                                 lambda_13[0][0]                  
__________________________________________________________________________________________________
permute_3 (Permute)             (8, 64, 329, 64)     0           add_3[0][0]                      
__________________________________________________________________________________________________
lambda_14 (Lambda)              (512, 329, 64)       0           permute_3[0][0]                  
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (512, 329, 200)      132000      lambda_14[0][0]                  
__________________________________________________________________________________________________
lambda_15 (Lambda)              (168448, 200)        0           bidirectional_4[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (168448, 128)        25728       lambda_15[0][0]                  
__________________________________________________________________________________________________
lambda_16 (Lambda)              (8, 2695168)         0           dense_4[0][0]                    
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (8, 2695168)         0           lambda_16[0][0]                  
__________________________________________________________________________________________________
lambda_17 (Lambda)              (8, 64, 329, 128)    0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
permute_4 (Permute)             (8, 329, 64, 128)    0           lambda_17[0][0]                  
__________________________________________________________________________________________________
lambda_18 (Lambda)              (8, 10560, 128)      0           permute_4[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (8, 10560, 64, 2)    0           lambda_18[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              (8, 10560, 64)       0           reshape_5[0][0]                  
__________________________________________________________________________________________________
lambda_22 (Lambda)              (8, 10560, 64)       0           reshape_5[0][0]                  
__________________________________________________________________________________________________
multiply_1 (Multiply)           (8, 10560, 64)       0           activation_1[0][0]               
                                                                 lambda_19[0][0]                  
__________________________________________________________________________________________________
multiply_2 (Multiply)           (8, 10560, 64)       0           activation_1[0][0]               
                                                                 lambda_22[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (8, 10560, 2)        130         multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_6 (Dense)                 (8, 10560, 2)        130         multiply_2[0][0]                 
__________________________________________________________________________________________________
lambda_20 (Lambda)              (8, 10561)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
lambda_23 (Lambda)              (8, 10561)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
lambda_21 (Lambda)              (8, 10561, 1)        0           lambda_20[0][0]                  
__________________________________________________________________________________________________
lambda_24 (Lambda)              (8, 10561, 1)        0           lambda_23[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (8, 10561, 2)        0           lambda_21[0][0]                  
                                                                 lambda_24[0][0]                  
__________________________________________________________________________________________________
lambda_25 (Lambda)              (8, 10547, 2)        0           concatenate_1[0][0]              
==================================================================================================
Total params: 592,772
Trainable params: 592,772
Non-trainable params: 0
__________________________________________________________________________________________________
