_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 10547, 1)          0         
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10560, 64)         192       
_________________________________________________________________
activation_1 (Activation)    (None, 10560, 64)         0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 329, 64, 64)       0         
_________________________________________________________________
reshape_5 (Reshape)          (None, 329, 4096)         0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 329, 200)          3357600   
_________________________________________________________________
bidirectional_2 (Bidirection (None, 329, 200)          240800    
_________________________________________________________________
dense_1 (Dense)              (None, 329, 4096)         823296    
_________________________________________________________________
reshape_6 (Reshape)          (None, 329, 64, 64)       0         
_________________________________________________________________
lambda_2 (Lambda)            (None, None, 64)          0         
_________________________________________________________________
dense_2 (Dense)              (None, None, 2)           130       
_________________________________________________________________
lambda_3 (Lambda)            (None, None)              0         
_________________________________________________________________
lambda_4 (Lambda)            (None, None, 1)           0         
_________________________________________________________________
lambda_5 (Lambda)            (None, None, 1)           0         
=================================================================
Total params: 4,422,018
Trainable params: 4,422,018
Non-trainable params: 0
_________________________________________________________________
