_________________________________________________________________
Layer (type)                 Output Shape              
=================================================================
input_1 (InputLayer)         (None, 10547, 1)          
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10560, 64)         
_________________________________________________________________
activation_1 (Activation)    (None, 10560, 64)         
_________________________________________________________________
lambda_1 (Lambda)            (None, 329, 64, 64)       
_________________________________________________________________
dprnn_block_1 (DprnnBlock)   (None, 329, 64, 64)       
_________________________________________________________________
dprnn_block_2 (DprnnBlock)   (None, 329, 64, 64)       
_________________________________________________________________
reshape_5 (Reshape)          (None, 329, 4096)         
_________________________________________________________________
dense_5 (Dense)              (None, 329, 64)           
_________________________________________________________________
layer_normalization_5 (Layer (None, 329, 64)           
_________________________________________________________________
lambda_2 (Lambda)            (None, None)              
_________________________________________________________________
lambda_3 (Lambda)            (None, None, 1)           
_________________________________________________________________
lambda_4 (Lambda)            (None, None, 1)           
=================================================================
_________________________________________________________________
