__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10547, 1)     0                                            
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10560, 64)    192         zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 10560, 64)    0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 329, 64, 64)  0           activation_1[0][0]               
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 329, 4096)    0           lambda_1[0][0]                   
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 329, 256)     4326400     reshape_5[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 329, 256)     394240      bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 329, 256)     394240      bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 329, 256)     394240      bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) (None, 329, 256)     394240      bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 329, 64)      16448       bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 329, 64)      16448       bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 329, 64)      16448       bidirectional_4[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 329, 64)      16448       bidirectional_5[0][0]            
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 329, 64)      0           dense_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 329, 64)      0           dense_2[0][0]                    
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 329, 64)      0           dense_3[0][0]                    
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 329, 64)      0           dense_4[0][0]                    
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None)         0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, None)         0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, None)         0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, None)         0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, None, 1)      0           lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, None, 1)      0           lambda_4[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, None, 1)      0           lambda_6[0][0]                   
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, None, 1)      0           lambda_8[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 4)      0           lambda_3[0][0]                   
                                                                 lambda_5[0][0]                   
                                                                 lambda_7[0][0]                   
                                                                 lambda_9[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, None, 4)      0           concatenate_1[0][0]              
==================================================================================================
Total params: 5,969,344
Trainable params: 5,969,344
Non-trainable params: 0
__________________________________________________________________________________________________
