__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10547, 1)     0                                            
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10560, 64)    192         zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 10560, 64)    0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 329, 64, 64)  0           activation_1[0][0]               
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 329, 4096)    0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 329, 200)     3437600     reshape_5[0][0]                  
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 329, 200)     320800      lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 329, 8192)    1646592     lstm_2[0][0]                     
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 329, 64, 128) 0           dense_1[0][0]                    
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None, 128)    0           reshape_6[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 10560, 64, 2) 0           lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 10560, 64)    0           reshape_7[0][0]                  
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 10560, 64)    0           reshape_7[0][0]                  
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 10560, 64)    0           activation_1[0][0]               
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 10560, 64)    0           activation_1[0][0]               
                                                                 lambda_6[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10560, 2)     130         multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10560, 2)     130         multiply_2[0][0]                 
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, None)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, None)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, None, 1)      0           lambda_4[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, None, 1)      0           lambda_7[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 2)      0           lambda_5[0][0]                   
                                                                 lambda_8[0][0]                   
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, None, 2)      0           concatenate_1[0][0]              
==================================================================================================
Total params: 5,405,444
Trainable params: 5,405,444
Non-trainable params: 0
__________________________________________________________________________________________________
