__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 4, 1)         0                                            
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 1)         0           lambda_13[0][0]                  
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 1)         0           lambda_14[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 1, 1)         0           lambda_15[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 1, 1)         0           lambda_16[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1, 84224)     84224       reshape_1[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1, 84224)     84224       reshape_3[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1, 84224)     84224       reshape_5[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1, 84224)     84224       reshape_7[0][0]                  
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 329, 256)     0           dense_5[0][0]                    
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 329, 256)     0           dense_6[0][0]                    
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 329, 256)     0           dense_7[0][0]                    
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 329, 256)     0           dense_8[0][0]                    
__________________________________________________________________________________________________
model_1 (Model)                 (None, None, 1)      410688      reshape_2[0][0]                  
__________________________________________________________________________________________________
model_2 (Model)                 (None, None, 1)      410688      reshape_4[0][0]                  
__________________________________________________________________________________________________
model_3 (Model)                 (None, None, 1)      410688      reshape_6[0][0]                  
__________________________________________________________________________________________________
model_4 (Model)                 (None, None, 1)      410688      reshape_8[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 1)      0           model_1[1][0]                    
                                                                 model_2[1][0]                    
                                                                 model_3[1][0]                    
                                                                 model_4[1][0]                    
==================================================================================================
Total params: 1,979,648
Trainable params: 336,896
Non-trainable params: 1,642,752
__________________________________________________________________________________________________
