_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 10547, 1)          0         
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10560, 16)         64        
_________________________________________________________________
activation_1 (Activation)    (None, 10560, 16)         0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 5280, 16)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 5280, 16)          784       
_________________________________________________________________
activation_2 (Activation)    (None, 5280, 16)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 2640, 16)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 2640, 32)          1568      
_________________________________________________________________
activation_3 (Activation)    (None, 2640, 32)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 1320, 32)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1320, 32)          3104      
_________________________________________________________________
activation_4 (Activation)    (None, 1320, 32)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 660, 32)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 660, 64)           6208      
_________________________________________________________________
activation_5 (Activation)    (None, 660, 64)           0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 330, 64)           0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 330, 64)           12352     
_________________________________________________________________
activation_6 (Activation)    (None, 330, 64)           0         
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 165, 64)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 165, 128)          24704     
_________________________________________________________________
activation_7 (Activation)    (None, 165, 128)          0         
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 83, 128)           0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 83, 128)           49280     
_________________________________________________________________
activation_8 (Activation)    (None, 83, 128)           0         
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, 42, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 42, 256)           98560     
_________________________________________________________________
activation_9 (Activation)    (None, 42, 256)           0         
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 21, 256)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 21, 256)           196864    
_________________________________________________________________
activation_10 (Activation)   (None, 21, 256)           0         
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 11, 256)           0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 11, 256)           196864    
_________________________________________________________________
activation_11 (Activation)   (None, 11, 256)           0         
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 6, 256)            0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 6, 256)            196864    
_________________________________________________________________
activation_12 (Activation)   (None, 6, 256)            0         
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 3, 256)            0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 1, 256)            196864    
_________________________________________________________________
activation_13 (Activation)   (None, 1, 256)            0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 1, 1, 256)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 3, 1, 256)         65792     
_________________________________________________________________
lambda_2 (Lambda)            (None, 3, 256)            0         
_________________________________________________________________
lambda_3 (Lambda)            (None, 3, 1, 256)         0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 6, 1, 256)         131328    
_________________________________________________________________
lambda_4 (Lambda)            (None, 6, 256)            0         
_________________________________________________________________
lambda_5 (Lambda)            (None, 6, 1, 256)         0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 12, 1, 256)        131328    
_________________________________________________________________
lambda_6 (Lambda)            (None, 12, 256)           0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 11, 256)           131328    
_________________________________________________________________
lambda_7 (Lambda)            (None, 11, 1, 256)        0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 22, 1, 256)        131328    
_________________________________________________________________
lambda_8 (Lambda)            (None, 22, 256)           0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 21, 256)           131328    
_________________________________________________________________
lambda_9 (Lambda)            (None, 21, 1, 256)        0         
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 42, 1, 256)        131328    
_________________________________________________________________
lambda_10 (Lambda)           (None, 42, 256)           0         
_________________________________________________________________
lambda_11 (Lambda)           (None, 42, 1, 256)        0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 84, 1, 128)        65664     
_________________________________________________________________
lambda_12 (Lambda)           (None, 84, 128)           0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 83, 128)           32896     
_________________________________________________________________
lambda_13 (Lambda)           (None, 83, 1, 128)        0         
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 166, 1, 128)       32896     
_________________________________________________________________
lambda_14 (Lambda)           (None, 166, 128)          0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 165, 128)          32896     
_________________________________________________________________
lambda_15 (Lambda)           (None, 165, 1, 128)       0         
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 330, 1, 64)        16448     
_________________________________________________________________
lambda_16 (Lambda)           (None, 330, 64)           0         
_________________________________________________________________
lambda_17 (Lambda)           (None, 330, 1, 64)        0         
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 660, 1, 64)        8256      
_________________________________________________________________
lambda_18 (Lambda)           (None, 660, 64)           0         
_________________________________________________________________
lambda_19 (Lambda)           (None, 660, 1, 64)        0         
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 1320, 1, 32)       4128      
_________________________________________________________________
lambda_20 (Lambda)           (None, 1320, 32)          0         
_________________________________________________________________
lambda_21 (Lambda)           (None, 1320, 1, 32)       0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 2640, 1, 32)       2080      
_________________________________________________________________
lambda_22 (Lambda)           (None, 2640, 32)          0         
_________________________________________________________________
lambda_23 (Lambda)           (None, 2640, 1, 32)       0         
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 5280, 1, 16)       1040      
_________________________________________________________________
lambda_24 (Lambda)           (None, 5280, 16)          0         
_________________________________________________________________
lambda_25 (Lambda)           (None, 5280, 1, 16)       0         
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 10560, 1, 16)      528       
_________________________________________________________________
lambda_26 (Lambda)           (None, 10560, 16)         0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 10560, 1)          17        
_________________________________________________________________
lambda_27 (Lambda)           (None, 10547, 1)          0         
=================================================================
Total params: 2,034,689
Trainable params: 2,034,689
Non-trainable params: 0
_________________________________________________________________
