Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 10547, 1)]   0                                            
__________________________________________________________________________________________________
zero_padding1d (ZeroPadding1D)  (None, 10560, 1)     0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 10560, 64)    192         zero_padding1d[0][0]             
__________________________________________________________________________________________________
activation (Activation)         (None, 10560, 64)    0           conv1d[0][0]                     
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 329, 64, 64)  0           activation[0][0]                 
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 329, 4096)    0           lambda[0][0]                     
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 329, 200)     3357600     reshape_2[0][0]                  
__________________________________________________________________________________________________
Dense_me_0 (Dense)              (None, 329, 200)     40200       bidirectional[0][0]              
__________________________________________________________________________________________________
Dense_me_1 (Dense)              (None, 329, 200)     40200       bidirectional[0][0]              
__________________________________________________________________________________________________
Dense_me_2 (Dense)              (None, 329, 200)     40200       bidirectional[0][0]              
__________________________________________________________________________________________________
Dense_me_3 (Dense)              (None, 329, 200)     40200       bidirectional[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 329, 200)     240800      Dense_me_0[0][0]                 
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 329, 200)     240800      Dense_me_1[0][0]                 
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 329, 200)     240800      Dense_me_2[0][0]                 
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 329, 200)     240800      Dense_me_3[0][0]                 
__________________________________________________________________________________________________
dense (Dense)                   (None, 329, 4096)    823296      bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 329, 4096)    823296      bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 329, 4096)    823296      bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 329, 4096)    823296      bidirectional_4[0][0]            
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 329, 64, 64)  0           dense[0][0]                      
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 329, 64, 64)  0           dense_2[0][0]                    
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 329, 64, 64)  0           dense_4[0][0]                    
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 329, 64, 64)  0           dense_6[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, 64)     0           reshape_3[0][0]                  
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, None, 64)     0           reshape_4[0][0]                  
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, None, 64)     0           reshape_5[0][0]                  
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, None, 64)     0           reshape_6[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 2)      130         lambda_1[0][0]                   
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, None, 2)      130         lambda_4[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, None, 2)      130         lambda_7[0][0]                   
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, None, 2)      130         lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, None)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, None)         0           dense_5[0][0]                    
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, None)         0           dense_7[0][0]                    
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, None, 1)      0           lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, None, 1)      0           lambda_5[0][0]                   
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, None, 1)      0           lambda_8[0][0]                   
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, None, 1)      0           lambda_11[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, 4)      0           lambda_3[0][0]                   
                                                                 lambda_6[0][0]                   
                                                                 lambda_9[0][0]                   
                                                                 lambda_12[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, None, 4)      0           concatenate[0][0]                
==================================================================================================
Total params: 7,775,496
Trainable params: 3,518,592
Non-trainable params: 4,256,904
__________________________________________________________________________________________________
