__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
raw_input (InputLayer)          (None, 10547, 1)     0                                            
__________________________________________________________________________________________________
zero_padding1d_1 (ZeroPadding1D (None, 10560, 1)     0           raw_input[0][0]                  
__________________________________________________________________________________________________
Down_Conv_0 (Conv1D)            (None, 10560, 24)    384         zero_padding1d_1[0][0]           
__________________________________________________________________________________________________
Down_Conv_Activ_0 (LeakyReLU)   (None, 10560, 24)    0           Down_Conv_0[0][0]                
__________________________________________________________________________________________________
Decimate_0 (Lambda)             (None, 5280, 24)     0           Down_Conv_Activ_0[0][0]          
__________________________________________________________________________________________________
Down_Conv_1 (Conv1D)            (None, 5280, 48)     17328       Decimate_0[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_1 (LeakyReLU)   (None, 5280, 48)     0           Down_Conv_1[0][0]                
__________________________________________________________________________________________________
Decimate_1 (Lambda)             (None, 2640, 48)     0           Down_Conv_Activ_1[0][0]          
__________________________________________________________________________________________________
Down_Conv_2 (Conv1D)            (None, 2640, 72)     51912       Decimate_1[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_2 (LeakyReLU)   (None, 2640, 72)     0           Down_Conv_2[0][0]                
__________________________________________________________________________________________________
Decimate_2 (Lambda)             (None, 1320, 72)     0           Down_Conv_Activ_2[0][0]          
__________________________________________________________________________________________________
Down_Conv_3 (Conv1D)            (None, 1320, 96)     103776      Decimate_2[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_3 (LeakyReLU)   (None, 1320, 96)     0           Down_Conv_3[0][0]                
__________________________________________________________________________________________________
Decimate_3 (Lambda)             (None, 660, 96)      0           Down_Conv_Activ_3[0][0]          
__________________________________________________________________________________________________
Down_Conv_4 (Conv1D)            (None, 660, 120)     172920      Decimate_3[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_4 (LeakyReLU)   (None, 660, 120)     0           Down_Conv_4[0][0]                
__________________________________________________________________________________________________
exp_dims_0 (Lambda)             (None, 1, 660, 120)  0           Down_Conv_Activ_4[0][0]          
__________________________________________________________________________________________________
IntPol_0 (InterpolationLayer)   (None, 1, 1320, 120) 120         exp_dims_0[0][0]                 
__________________________________________________________________________________________________
sq_dims_0 (Lambda)              (None, 1320, 120)    0           IntPol_0[0][0]                   
__________________________________________________________________________________________________
CropConcat_0 (CropConcatLayer)  (None, 1320, 216)    0           Down_Conv_Activ_3[0][0]          
                                                                 sq_dims_0[0][0]                  
__________________________________________________________________________________________________
Up_Conv_0 (Conv1D)              (None, 1320, 96)     103776      CropConcat_0[0][0]               
__________________________________________________________________________________________________
Up_Conv_Activ_0 (LeakyReLU)     (None, 1320, 96)     0           Up_Conv_0[0][0]                  
__________________________________________________________________________________________________
exp_dims_1 (Lambda)             (None, 1, 1320, 96)  0           Up_Conv_Activ_0[0][0]            
__________________________________________________________________________________________________
IntPol_1 (InterpolationLayer)   (None, 1, 2640, 96)  96          exp_dims_1[0][0]                 
__________________________________________________________________________________________________
sq_dims_1 (Lambda)              (None, 2640, 96)     0           IntPol_1[0][0]                   
__________________________________________________________________________________________________
CropConcat_1 (CropConcatLayer)  (None, 2640, 168)    0           Down_Conv_Activ_2[0][0]          
                                                                 sq_dims_1[0][0]                  
__________________________________________________________________________________________________
Up_Conv_1 (Conv1D)              (None, 2640, 72)     60552       CropConcat_1[0][0]               
__________________________________________________________________________________________________
Up_Conv_Activ_1 (LeakyReLU)     (None, 2640, 72)     0           Up_Conv_1[0][0]                  
__________________________________________________________________________________________________
exp_dims_2 (Lambda)             (None, 1, 2640, 72)  0           Up_Conv_Activ_1[0][0]            
__________________________________________________________________________________________________
IntPol_2 (InterpolationLayer)   (None, 1, 5280, 72)  72          exp_dims_2[0][0]                 
__________________________________________________________________________________________________
sq_dims_2 (Lambda)              (None, 5280, 72)     0           IntPol_2[0][0]                   
__________________________________________________________________________________________________
CropConcat_2 (CropConcatLayer)  (None, 5280, 120)    0           Down_Conv_Activ_1[0][0]          
                                                                 sq_dims_2[0][0]                  
__________________________________________________________________________________________________
Up_Conv_2 (Conv1D)              (None, 5280, 48)     28848       CropConcat_2[0][0]               
__________________________________________________________________________________________________
Up_Conv_Activ_2 (LeakyReLU)     (None, 5280, 48)     0           Up_Conv_2[0][0]                  
__________________________________________________________________________________________________
exp_dims_3 (Lambda)             (None, 1, 5280, 48)  0           Up_Conv_Activ_2[0][0]            
__________________________________________________________________________________________________
IntPol_3 (InterpolationLayer)   (None, 1, 10560, 48) 48          exp_dims_3[0][0]                 
__________________________________________________________________________________________________
sq_dims_3 (Lambda)              (None, 10560, 48)    0           IntPol_3[0][0]                   
__________________________________________________________________________________________________
CropConcat_3 (CropConcatLayer)  (None, 10560, 72)    0           Down_Conv_Activ_0[0][0]          
                                                                 sq_dims_3[0][0]                  
__________________________________________________________________________________________________
Up_Conv_3 (Conv1D)              (None, 10560, 24)    8664        CropConcat_3[0][0]               
__________________________________________________________________________________________________
Up_Conv_Activ_3 (LeakyReLU)     (None, 10560, 24)    0           Up_Conv_3[0][0]                  
__________________________________________________________________________________________________
CropConcat_4 (CropConcatLayer)  (None, 10560, 25)    0           zero_padding1d_1[0][0]           
                                                                 Up_Conv_Activ_3[0][0]            
__________________________________________________________________________________________________
independent_out_0 (Conv1D)      (None, 10560, 1)     26          CropConcat_4[0][0]               
__________________________________________________________________________________________________
independent_out_1 (Conv1D)      (None, 10560, 1)     26          CropConcat_4[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 10560, 2)     0           independent_out_0[0][0]          
                                                                 independent_out_1[0][0]          
__________________________________________________________________________________________________
Out_clip (Lambda)               (None, 10547, 2)     0           concatenate_1[0][0]              
==================================================================================================
Total params: 548,548
Trainable params: 548,548
Non-trainable params: 0
__________________________________________________________________________________________________
