Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
raw_input (InputLayer)          [(None, 10547, 1)]   0                                            
__________________________________________________________________________________________________
zero_padding1d (ZeroPadding1D)  (None, 10560, 1)     0           raw_input[0][0]                  
__________________________________________________________________________________________________
Down_Conv_0 (Conv1D)            (None, 10560, 24)    384         zero_padding1d[0][0]             
__________________________________________________________________________________________________
Down_Conv_Activ_0 (LeakyReLU)   (None, 10560, 24)    0           Down_Conv_0[0][0]                
__________________________________________________________________________________________________
Down_BN_0 (BatchNormalization)  (None, 10560, 24)    96          Down_Conv_Activ_0[0][0]          
__________________________________________________________________________________________________
Decimate_0 (Lambda)             (None, 5280, 24)     0           Down_BN_0[0][0]                  
__________________________________________________________________________________________________
Down_Conv_1 (Conv1D)            (None, 5280, 48)     17328       Decimate_0[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_1 (LeakyReLU)   (None, 5280, 48)     0           Down_Conv_1[0][0]                
__________________________________________________________________________________________________
Down_BN_1 (BatchNormalization)  (None, 5280, 48)     192         Down_Conv_Activ_1[0][0]          
__________________________________________________________________________________________________
Decimate_1 (Lambda)             (None, 2640, 48)     0           Down_BN_1[0][0]                  
__________________________________________________________________________________________________
Down_Conv_2 (Conv1D)            (None, 2640, 72)     51912       Decimate_1[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_2 (LeakyReLU)   (None, 2640, 72)     0           Down_Conv_2[0][0]                
__________________________________________________________________________________________________
Down_BN_2 (BatchNormalization)  (None, 2640, 72)     288         Down_Conv_Activ_2[0][0]          
__________________________________________________________________________________________________
Decimate_2 (Lambda)             (None, 1320, 72)     0           Down_BN_2[0][0]                  
__________________________________________________________________________________________________
Down_Conv_3 (Conv1D)            (None, 1320, 96)     103776      Decimate_2[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_3 (LeakyReLU)   (None, 1320, 96)     0           Down_Conv_3[0][0]                
__________________________________________________________________________________________________
Down_BN_3 (BatchNormalization)  (None, 1320, 96)     384         Down_Conv_Activ_3[0][0]          
__________________________________________________________________________________________________
Decimate_3 (Lambda)             (None, 660, 96)      0           Down_BN_3[0][0]                  
__________________________________________________________________________________________________
Down_Conv_4 (Conv1D)            (None, 660, 120)     172920      Decimate_3[0][0]                 
__________________________________________________________________________________________________
Down_Conv_Activ_4 (LeakyReLU)   (None, 660, 120)     0           Down_Conv_4[0][0]                
__________________________________________________________________________________________________
Down_BN_4 (BatchNormalization)  (None, 660, 120)     480         Down_Conv_Activ_4[0][0]          
__________________________________________________________________________________________________
exp_dims_0_0 (Lambda)           (None, 1, 660, 120)  0           Down_BN_4[0][0]                  
__________________________________________________________________________________________________
exp_dims_1_0 (Lambda)           (None, 1, 660, 120)  0           Down_BN_4[0][0]                  
__________________________________________________________________________________________________
exp_dims_2_0 (Lambda)           (None, 1, 660, 120)  0           Down_BN_4[0][0]                  
__________________________________________________________________________________________________
exp_dims_3_0 (Lambda)           (None, 1, 660, 120)  0           Down_BN_4[0][0]                  
__________________________________________________________________________________________________
IntPol_0_0 (InterpolationLayer) (None, 1, 1320, 120) 120         exp_dims_0_0[0][0]               
__________________________________________________________________________________________________
IntPol_1_0 (InterpolationLayer) (None, 1, 1320, 120) 120         exp_dims_1_0[0][0]               
__________________________________________________________________________________________________
IntPol_2_0 (InterpolationLayer) (None, 1, 1320, 120) 120         exp_dims_2_0[0][0]               
__________________________________________________________________________________________________
IntPol_3_0 (InterpolationLayer) (None, 1, 1320, 120) 120         exp_dims_3_0[0][0]               
__________________________________________________________________________________________________
sq_dims_0_0 (Lambda)            (None, 1320, 120)    0           IntPol_0_0[0][0]                 
__________________________________________________________________________________________________
sq_dims_1_0 (Lambda)            (None, 1320, 120)    0           IntPol_1_0[0][0]                 
__________________________________________________________________________________________________
sq_dims_2_0 (Lambda)            (None, 1320, 120)    0           IntPol_2_0[0][0]                 
__________________________________________________________________________________________________
sq_dims_3_0 (Lambda)            (None, 1320, 120)    0           IntPol_3_0[0][0]                 
__________________________________________________________________________________________________
Up_Conv_0_0 (Conv1D)            (None, 1320, 96)     57696       sq_dims_0_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_1_0 (Conv1D)            (None, 1320, 96)     57696       sq_dims_1_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_2_0 (Conv1D)            (None, 1320, 96)     57696       sq_dims_2_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_3_0 (Conv1D)            (None, 1320, 96)     57696       sq_dims_3_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_0_0 (LeakyReLU)   (None, 1320, 96)     0           Up_Conv_0_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_1_0 (LeakyReLU)   (None, 1320, 96)     0           Up_Conv_1_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_2_0 (LeakyReLU)   (None, 1320, 96)     0           Up_Conv_2_0[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_3_0 (LeakyReLU)   (None, 1320, 96)     0           Up_Conv_3_0[0][0]                
__________________________________________________________________________________________________
Up_BN_0_0 (BatchNormalization)  (None, 1320, 96)     384         Up_Conv_Activ_0_0[0][0]          
__________________________________________________________________________________________________
Up_BN_1_0 (BatchNormalization)  (None, 1320, 96)     384         Up_Conv_Activ_1_0[0][0]          
__________________________________________________________________________________________________
Up_BN_2_0 (BatchNormalization)  (None, 1320, 96)     384         Up_Conv_Activ_2_0[0][0]          
__________________________________________________________________________________________________
Up_BN_3_0 (BatchNormalization)  (None, 1320, 96)     384         Up_Conv_Activ_3_0[0][0]          
__________________________________________________________________________________________________
exp_dims_0_1 (Lambda)           (None, 1, 1320, 96)  0           Up_BN_0_0[0][0]                  
__________________________________________________________________________________________________
exp_dims_1_1 (Lambda)           (None, 1, 1320, 96)  0           Up_BN_1_0[0][0]                  
__________________________________________________________________________________________________
exp_dims_2_1 (Lambda)           (None, 1, 1320, 96)  0           Up_BN_2_0[0][0]                  
__________________________________________________________________________________________________
exp_dims_3_1 (Lambda)           (None, 1, 1320, 96)  0           Up_BN_3_0[0][0]                  
__________________________________________________________________________________________________
IntPol_0_1 (InterpolationLayer) (None, 1, 2640, 96)  96          exp_dims_0_1[0][0]               
__________________________________________________________________________________________________
IntPol_1_1 (InterpolationLayer) (None, 1, 2640, 96)  96          exp_dims_1_1[0][0]               
__________________________________________________________________________________________________
IntPol_2_1 (InterpolationLayer) (None, 1, 2640, 96)  96          exp_dims_2_1[0][0]               
__________________________________________________________________________________________________
IntPol_3_1 (InterpolationLayer) (None, 1, 2640, 96)  96          exp_dims_3_1[0][0]               
__________________________________________________________________________________________________
sq_dims_0_1 (Lambda)            (None, 2640, 96)     0           IntPol_0_1[0][0]                 
__________________________________________________________________________________________________
sq_dims_1_1 (Lambda)            (None, 2640, 96)     0           IntPol_1_1[0][0]                 
__________________________________________________________________________________________________
sq_dims_2_1 (Lambda)            (None, 2640, 96)     0           IntPol_2_1[0][0]                 
__________________________________________________________________________________________________
sq_dims_3_1 (Lambda)            (None, 2640, 96)     0           IntPol_3_1[0][0]                 
__________________________________________________________________________________________________
Up_Conv_0_1 (Conv1D)            (None, 2640, 72)     34632       sq_dims_0_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_1_1 (Conv1D)            (None, 2640, 72)     34632       sq_dims_1_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_2_1 (Conv1D)            (None, 2640, 72)     34632       sq_dims_2_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_3_1 (Conv1D)            (None, 2640, 72)     34632       sq_dims_3_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_0_1 (LeakyReLU)   (None, 2640, 72)     0           Up_Conv_0_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_1_1 (LeakyReLU)   (None, 2640, 72)     0           Up_Conv_1_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_2_1 (LeakyReLU)   (None, 2640, 72)     0           Up_Conv_2_1[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_3_1 (LeakyReLU)   (None, 2640, 72)     0           Up_Conv_3_1[0][0]                
__________________________________________________________________________________________________
Up_BN_0_1 (BatchNormalization)  (None, 2640, 72)     288         Up_Conv_Activ_0_1[0][0]          
__________________________________________________________________________________________________
Up_BN_1_1 (BatchNormalization)  (None, 2640, 72)     288         Up_Conv_Activ_1_1[0][0]          
__________________________________________________________________________________________________
Up_BN_2_1 (BatchNormalization)  (None, 2640, 72)     288         Up_Conv_Activ_2_1[0][0]          
__________________________________________________________________________________________________
Up_BN_3_1 (BatchNormalization)  (None, 2640, 72)     288         Up_Conv_Activ_3_1[0][0]          
__________________________________________________________________________________________________
exp_dims_0_2 (Lambda)           (None, 1, 2640, 72)  0           Up_BN_0_1[0][0]                  
__________________________________________________________________________________________________
exp_dims_1_2 (Lambda)           (None, 1, 2640, 72)  0           Up_BN_1_1[0][0]                  
__________________________________________________________________________________________________
exp_dims_2_2 (Lambda)           (None, 1, 2640, 72)  0           Up_BN_2_1[0][0]                  
__________________________________________________________________________________________________
exp_dims_3_2 (Lambda)           (None, 1, 2640, 72)  0           Up_BN_3_1[0][0]                  
__________________________________________________________________________________________________
IntPol_0_2 (InterpolationLayer) (None, 1, 5280, 72)  72          exp_dims_0_2[0][0]               
__________________________________________________________________________________________________
IntPol_1_2 (InterpolationLayer) (None, 1, 5280, 72)  72          exp_dims_1_2[0][0]               
__________________________________________________________________________________________________
IntPol_2_2 (InterpolationLayer) (None, 1, 5280, 72)  72          exp_dims_2_2[0][0]               
__________________________________________________________________________________________________
IntPol_3_2 (InterpolationLayer) (None, 1, 5280, 72)  72          exp_dims_3_2[0][0]               
__________________________________________________________________________________________________
sq_dims_0_2 (Lambda)            (None, 5280, 72)     0           IntPol_0_2[0][0]                 
__________________________________________________________________________________________________
sq_dims_1_2 (Lambda)            (None, 5280, 72)     0           IntPol_1_2[0][0]                 
__________________________________________________________________________________________________
sq_dims_2_2 (Lambda)            (None, 5280, 72)     0           IntPol_2_2[0][0]                 
__________________________________________________________________________________________________
sq_dims_3_2 (Lambda)            (None, 5280, 72)     0           IntPol_3_2[0][0]                 
__________________________________________________________________________________________________
Up_Conv_0_2 (Conv1D)            (None, 5280, 48)     17328       sq_dims_0_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_1_2 (Conv1D)            (None, 5280, 48)     17328       sq_dims_1_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_2_2 (Conv1D)            (None, 5280, 48)     17328       sq_dims_2_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_3_2 (Conv1D)            (None, 5280, 48)     17328       sq_dims_3_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_0_2 (LeakyReLU)   (None, 5280, 48)     0           Up_Conv_0_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_1_2 (LeakyReLU)   (None, 5280, 48)     0           Up_Conv_1_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_2_2 (LeakyReLU)   (None, 5280, 48)     0           Up_Conv_2_2[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_3_2 (LeakyReLU)   (None, 5280, 48)     0           Up_Conv_3_2[0][0]                
__________________________________________________________________________________________________
Up_BN_0_2 (BatchNormalization)  (None, 5280, 48)     192         Up_Conv_Activ_0_2[0][0]          
__________________________________________________________________________________________________
Up_BN_1_2 (BatchNormalization)  (None, 5280, 48)     192         Up_Conv_Activ_1_2[0][0]          
__________________________________________________________________________________________________
Up_BN_2_2 (BatchNormalization)  (None, 5280, 48)     192         Up_Conv_Activ_2_2[0][0]          
__________________________________________________________________________________________________
Up_BN_3_2 (BatchNormalization)  (None, 5280, 48)     192         Up_Conv_Activ_3_2[0][0]          
__________________________________________________________________________________________________
exp_dims_0_3 (Lambda)           (None, 1, 5280, 48)  0           Up_BN_0_2[0][0]                  
__________________________________________________________________________________________________
exp_dims_1_3 (Lambda)           (None, 1, 5280, 48)  0           Up_BN_1_2[0][0]                  
__________________________________________________________________________________________________
exp_dims_2_3 (Lambda)           (None, 1, 5280, 48)  0           Up_BN_2_2[0][0]                  
__________________________________________________________________________________________________
exp_dims_3_3 (Lambda)           (None, 1, 5280, 48)  0           Up_BN_3_2[0][0]                  
__________________________________________________________________________________________________
IntPol_0_3 (InterpolationLayer) (None, 1, 10560, 48) 48          exp_dims_0_3[0][0]               
__________________________________________________________________________________________________
IntPol_1_3 (InterpolationLayer) (None, 1, 10560, 48) 48          exp_dims_1_3[0][0]               
__________________________________________________________________________________________________
IntPol_2_3 (InterpolationLayer) (None, 1, 10560, 48) 48          exp_dims_2_3[0][0]               
__________________________________________________________________________________________________
IntPol_3_3 (InterpolationLayer) (None, 1, 10560, 48) 48          exp_dims_3_3[0][0]               
__________________________________________________________________________________________________
sq_dims_0_3 (Lambda)            (None, 10560, 48)    0           IntPol_0_3[0][0]                 
__________________________________________________________________________________________________
sq_dims_1_3 (Lambda)            (None, 10560, 48)    0           IntPol_1_3[0][0]                 
__________________________________________________________________________________________________
sq_dims_2_3 (Lambda)            (None, 10560, 48)    0           IntPol_2_3[0][0]                 
__________________________________________________________________________________________________
sq_dims_3_3 (Lambda)            (None, 10560, 48)    0           IntPol_3_3[0][0]                 
__________________________________________________________________________________________________
Up_Conv_0_3 (Conv1D)            (None, 10560, 24)    5784        sq_dims_0_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_1_3 (Conv1D)            (None, 10560, 24)    5784        sq_dims_1_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_2_3 (Conv1D)            (None, 10560, 24)    5784        sq_dims_2_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_3_3 (Conv1D)            (None, 10560, 24)    5784        sq_dims_3_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_0_3 (LeakyReLU)   (None, 10560, 24)    0           Up_Conv_0_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_1_3 (LeakyReLU)   (None, 10560, 24)    0           Up_Conv_1_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_2_3 (LeakyReLU)   (None, 10560, 24)    0           Up_Conv_2_3[0][0]                
__________________________________________________________________________________________________
Up_Conv_Activ_3_3 (LeakyReLU)   (None, 10560, 24)    0           Up_Conv_3_3[0][0]                
__________________________________________________________________________________________________
Up_BN_0_3 (BatchNormalization)  (None, 10560, 24)    96          Up_Conv_Activ_0_3[0][0]          
__________________________________________________________________________________________________
Up_BN_1_3 (BatchNormalization)  (None, 10560, 24)    96          Up_Conv_Activ_1_3[0][0]          
__________________________________________________________________________________________________
Up_BN_2_3 (BatchNormalization)  (None, 10560, 24)    96          Up_Conv_Activ_2_3[0][0]          
__________________________________________________________________________________________________
Up_BN_3_3 (BatchNormalization)  (None, 10560, 24)    96          Up_Conv_Activ_3_3[0][0]          
__________________________________________________________________________________________________
independent_out_0 (Conv1D)      (None, 10560, 1)     25          Up_BN_0_3[0][0]                  
__________________________________________________________________________________________________
independent_out_1 (Conv1D)      (None, 10560, 1)     25          Up_BN_1_3[0][0]                  
__________________________________________________________________________________________________
independent_out_2 (Conv1D)      (None, 10560, 1)     25          Up_BN_2_3[0][0]                  
__________________________________________________________________________________________________
independent_out_3 (Conv1D)      (None, 10560, 1)     25          Up_BN_3_3[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10560, 4)     0           independent_out_0[0][0]          
                                                                 independent_out_1[0][0]          
                                                                 independent_out_2[0][0]          
                                                                 independent_out_3[0][0]          
__________________________________________________________________________________________________
Out_clip (Lambda)               (None, 10547, 4)     0           concatenate[0][0]                
==================================================================================================
Total params: 814,804
Trainable params: 812,164
Non-trainable params: 2,640
__________________________________________________________________________________________________
