Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 4, 1)]       0                                            
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 1)            0           input_5[0][0]                    
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 1, 1)         0           lambda_8[0][0]                   
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 1, 1)         0           lambda_9[0][0]                   
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 1, 1)         0           lambda_10[0][0]                  
__________________________________________________________________________________________________
reshape_14 (Reshape)            (None, 1, 1)         0           lambda_11[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 1, 675008)    675008      reshape_8[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1, 675008)    675008      reshape_10[0][0]                 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1, 675008)    675008      reshape_12[0][0]                 
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1, 675008)    675008      reshape_14[0][0]                 
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 10547, 64)    0           dense[0][0]                      
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 10547, 64)    0           dense_1[0][0]                    
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 10547, 64)    0           dense_2[0][0]                    
__________________________________________________________________________________________________
reshape_15 (Reshape)            (None, 10547, 64)    0           dense_3[0][0]                    
__________________________________________________________________________________________________
model (Functional)              (None, 10547, 1)     252097      reshape_9[0][0]                  
__________________________________________________________________________________________________
model_1 (Functional)            (None, 10547, 1)     252097      reshape_11[0][0]                 
__________________________________________________________________________________________________
model_2 (Functional)            (None, 10547, 1)     252097      reshape_13[0][0]                 
__________________________________________________________________________________________________
model_3 (Functional)            (None, 10547, 1)     252097      reshape_15[0][0]                 
__________________________________________________________________________________________________
add_52 (Add)                    (None, 10547, 1)     0           model[0][0]                      
                                                                 model_1[0][0]                    
                                                                 model_2[0][0]                    
                                                                 model_3[0][0]                    
==================================================================================================
Total params: 3,708,420
Trainable params: 2,700,032
Non-trainable params: 1,008,388
__________________________________________________________________________________________________
