_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
raw_input (InputLayer)       (None, 10547, 1)          0         
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          0         
_________________________________________________________________
Down_Conv_0 (Conv1D)         (None, 10560, 24)         384       
_________________________________________________________________
Down_Conv_Activ_0 (LeakyReLU (None, 10560, 24)         0         
_________________________________________________________________
Down_BN_0 (BatchNormalizatio (None, 10560, 24)         96        
_________________________________________________________________
Decimate_0 (Lambda)          (None, 5280, 24)          0         
_________________________________________________________________
Down_Conv_1 (Conv1D)         (None, 5280, 48)          17328     
_________________________________________________________________
Down_Conv_Activ_1 (LeakyReLU (None, 5280, 48)          0         
_________________________________________________________________
Down_BN_1 (BatchNormalizatio (None, 5280, 48)          192       
_________________________________________________________________
Decimate_1 (Lambda)          (None, 2640, 48)          0         
_________________________________________________________________
Down_Conv_2 (Conv1D)         (None, 2640, 72)          51912     
_________________________________________________________________
Down_Conv_Activ_2 (LeakyReLU (None, 2640, 72)          0         
_________________________________________________________________
Down_BN_2 (BatchNormalizatio (None, 2640, 72)          288       
_________________________________________________________________
Decimate_2 (Lambda)          (None, 1320, 72)          0         
_________________________________________________________________
Down_Conv_3 (Conv1D)         (None, 1320, 96)          103776    
_________________________________________________________________
Down_Conv_Activ_3 (LeakyReLU (None, 1320, 96)          0         
_________________________________________________________________
Down_BN_3 (BatchNormalizatio (None, 1320, 96)          384       
_________________________________________________________________
Decimate_3 (Lambda)          (None, 660, 96)           0         
_________________________________________________________________
Down_Conv_4 (Conv1D)         (None, 660, 120)          172920    
_________________________________________________________________
Down_Conv_Activ_4 (LeakyReLU (None, 660, 120)          0         
_________________________________________________________________
Down_BN_4 (BatchNormalizatio (None, 660, 120)          480       
_________________________________________________________________
exp_dims_0_0 (Lambda)        (None, 1, 660, 120)       0         
_________________________________________________________________
IntPol_0_0 (InterpolationLay (None, 1, 1320, 120)      120       
_________________________________________________________________
sq_dims_0_0 (Lambda)         (None, 1320, 120)         0         
_________________________________________________________________
Up_Conv_0_0 (Conv1D)         (None, 1320, 96)          57696     
_________________________________________________________________
Up_Conv_Activ_0_0 (LeakyReLU (None, 1320, 96)          0         
_________________________________________________________________
Up_BN_0_0 (BatchNormalizatio (None, 1320, 96)          384       
_________________________________________________________________
exp_dims_0_1 (Lambda)        (None, 1, 1320, 96)       0         
_________________________________________________________________
IntPol_0_1 (InterpolationLay (None, 1, 2640, 96)       96        
_________________________________________________________________
sq_dims_0_1 (Lambda)         (None, 2640, 96)          0         
_________________________________________________________________
Up_Conv_0_1 (Conv1D)         (None, 2640, 72)          34632     
_________________________________________________________________
Up_Conv_Activ_0_1 (LeakyReLU (None, 2640, 72)          0         
_________________________________________________________________
Up_BN_0_1 (BatchNormalizatio (None, 2640, 72)          288       
_________________________________________________________________
exp_dims_0_2 (Lambda)        (None, 1, 2640, 72)       0         
_________________________________________________________________
IntPol_0_2 (InterpolationLay (None, 1, 5280, 72)       72        
_________________________________________________________________
sq_dims_0_2 (Lambda)         (None, 5280, 72)          0         
_________________________________________________________________
Up_Conv_0_2 (Conv1D)         (None, 5280, 48)          17328     
_________________________________________________________________
Up_Conv_Activ_0_2 (LeakyReLU (None, 5280, 48)          0         
_________________________________________________________________
Up_BN_0_2 (BatchNormalizatio (None, 5280, 48)          192       
_________________________________________________________________
exp_dims_0_3 (Lambda)        (None, 1, 5280, 48)       0         
_________________________________________________________________
IntPol_0_3 (InterpolationLay (None, 1, 10560, 48)      48        
_________________________________________________________________
sq_dims_0_3 (Lambda)         (None, 10560, 48)         0         
_________________________________________________________________
Up_Conv_0_3 (Conv1D)         (None, 10560, 24)         5784      
_________________________________________________________________
Up_Conv_Activ_0_3 (LeakyReLU (None, 10560, 24)         0         
_________________________________________________________________
Up_BN_0_3 (BatchNormalizatio (None, 10560, 24)         96        
_________________________________________________________________
independent_out_0 (Conv1D)   (None, 10560, 1)          25        
_________________________________________________________________
Out_clip (Lambda)            (None, 10547, 1)          0         
=================================================================
Total params: 464,521
Trainable params: 463,321
Non-trainable params: 1,200
_________________________________________________________________
