_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 10547, 1)          0         
_________________________________________________________________
zero_padding1d_1 (ZeroPaddin (None, 10560, 1)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10560, 16)         64        
_________________________________________________________________
batch_normalization_1 (Batch (None, 10560, 16)         64        
_________________________________________________________________
activation_1 (Activation)    (None, 10560, 16)         0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 5280, 16)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 5280, 16)          784       
_________________________________________________________________
batch_normalization_2 (Batch (None, 5280, 16)          64        
_________________________________________________________________
activation_2 (Activation)    (None, 5280, 16)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 2640, 16)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 2640, 32)          1568      
_________________________________________________________________
batch_normalization_3 (Batch (None, 2640, 32)          128       
_________________________________________________________________
activation_3 (Activation)    (None, 2640, 32)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 1320, 32)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1320, 32)          3104      
_________________________________________________________________
batch_normalization_4 (Batch (None, 1320, 32)          128       
_________________________________________________________________
activation_4 (Activation)    (None, 1320, 32)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 660, 32)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 660, 64)           6208      
_________________________________________________________________
batch_normalization_5 (Batch (None, 660, 64)           256       
_________________________________________________________________
activation_5 (Activation)    (None, 660, 64)           0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 330, 64)           0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 330, 64)           12352     
_________________________________________________________________
batch_normalization_6 (Batch (None, 330, 64)           256       
_________________________________________________________________
activation_6 (Activation)    (None, 330, 64)           0         
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 165, 64)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 165, 128)          24704     
_________________________________________________________________
batch_normalization_7 (Batch (None, 165, 128)          512       
_________________________________________________________________
activation_7 (Activation)    (None, 165, 128)          0         
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 83, 128)           0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 83, 128)           49280     
_________________________________________________________________
batch_normalization_8 (Batch (None, 83, 128)           512       
_________________________________________________________________
activation_8 (Activation)    (None, 83, 128)           0         
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, 42, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 42, 256)           98560     
_________________________________________________________________
batch_normalization_9 (Batch (None, 42, 256)           1024      
_________________________________________________________________
activation_9 (Activation)    (None, 42, 256)           0         
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 21, 256)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 21, 256)           196864    
_________________________________________________________________
batch_normalization_10 (Batc (None, 21, 256)           1024      
_________________________________________________________________
activation_10 (Activation)   (None, 21, 256)           0         
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 11, 256)           0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 11, 256)           196864    
_________________________________________________________________
batch_normalization_11 (Batc (None, 11, 256)           1024      
_________________________________________________________________
activation_11 (Activation)   (None, 11, 256)           0         
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 6, 256)            0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 6, 256)            196864    
_________________________________________________________________
batch_normalization_12 (Batc (None, 6, 256)            1024      
_________________________________________________________________
activation_12 (Activation)   (None, 6, 256)            0         
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 3, 256)            0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 1, 256)            196864    
_________________________________________________________________
batch_normalization_13 (Batc (None, 1, 256)            1024      
_________________________________________________________________
activation_13 (Activation)   (None, 1, 256)            0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 256, 1)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               264192    
_________________________________________________________________
repeat_vector_1 (RepeatVecto (None, 10547, 256)        0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 10547, 256)        525312    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 10547, 1)          257       
=================================================================
Total params: 1,780,881
Trainable params: 1,777,361
Non-trainable params: 3,520
_________________________________________________________________
